site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

*** Испитна питања
:PROPERTIES:
:EXPORT_FILE_NAME: projekat
:END:
**** Основе УКС
1. Дефиниши појам "Управљање конфигурацијом софтвера"?
2. Мотиви за увођење УКС.
3. Шта је ставка конфигурације? Како настаје? Опиши њен живтни циклус.
4. Шта је референтна верзија?
5. Којe су активности у традиционалном УК.
6. Архитектура система УК
7. Дефиниши идентификацију конфигурације? Које особине мора да има?
8. Чиме се бави активност управљања променама? Шта су захтеви за променама?
9. Шта је догађај код активности управљања променама?
10. Чиме се бави активност праћења статуса?
11. Чиме се бави активност ревизије и верификације?
12. Опиши активност управљања изворним кодом. Шта нам омогућава? Које алате познајеш?
13. Опиши активност управљања изградњом софтвера. Шта нам омогућава? Којe алате
    познајеш?
14. Опиши активност управљања конфигурацијом окружења.
15. Опиши активност управљања променама. Који су основни принципи?
16. Опиши актиност управљања издањима. Који су основни принципи?
17. Опиши актиност управљања увођењем. Који су основни принципи?
18. Које се активности обављају приликом увођења УКС у организацији?
19. Како се обавља процена текућих процеса УКС?
20. Шта је /Capability Maturity Model/? Који су његови нивои?
**** Управљање изворним кодом
**** /Git/
**** /Docker/
